:PROPERTIES:
:ID:       91e39ba2-fe8b-485c-8386-e7912c415064
:END:
#+TITLE: Dice
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope nil :emphasize nil
#+CAPTION: Clock summary at [2024-04-13 Sat 17:13]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:26* |
|--------------+--------|
| 2.7 Dice     | 0:26   |
#+END
* 2.7 Dice
:LOGBOOK:
CLOCK: [2024-04-13 Sat 02:22]--[2024-04-13 Sat 02:48] =>  0:26
:END:
*A dice is loaded such that* \(6\) *occurs twice as often as* \(1\).
** 2.7.1
*Calculate the unbiased probabilities for the six faces of the dice.*

\begin{align*}
S (p_1) &= -p_1 \ln p_1 \\
&= -4 \bigg(\frac{1-3 p_1}{4}\bigg) \ln \bigg(\frac{1-3 p_1}{4}\bigg) -2 p_1 \ln \big(2 p_1\big)\\
&= -3 p_1 \ln p_1 - \big(1-3 p_1\big) \ln \big(1-3 p_1\big) - 8 p_1 \ln (2)
\end{align*}

\begin{align*}
D_{p_{1}} S &= 3 \ln \left(1-3 p_1\right)-3 \ln p_1-3+3-8 p_1 \ln (2) / p_1 \\
&=  3\left[\ln \left(1-3 p_1\right)-\ln p_1-(8 / 3) \ln (2)\right] = 3 \ln \left(\frac{1-3 p_1}{2^{8 / 3} p_1}\right)
\end{align*}

For the logarithm to vanish, its argument must equal unity

\begin{align*}
\frac{1-3 p_1}{2^{8 / 3} p_1}=1 \Rightarrow p_1=\frac{1}{3+2^{8 / 3}}.
\end{align*}

We thus recover the unbiased probabilities for the six faces of the dice

\begin{align*}
p_1=\frac{1}{3+2^{8 / 3}}, p_2=p_3=p_4=p_5=\frac{2^{8 / 3}}{12+2^{14 / 3}}, p_6=\frac{2}{3+2^{8 / 3}}.
\end{align*}

** 2.7.2
*What is the information content (in bits) of the above statement regarding the dice?*

The information content is

\begin{align*}
I\left(\left\{p_i\right\}\right) & =\log_2 6+\sum_{i=1}^6 p_i \log_2 p_i=\log_2 6+\log_2 \bigg(\frac{2^{2 / 3}}{3+2^{8 / 3}}\bigg) \\
& =\frac{5}{3}+\log_2 \frac{3}{3+2^{8 / 3}} \approx 0.03 \, \text {bits}.
\end{align*}
